/*
* 算法竞赛入门 1.5.1
* 编译环境：Win10 + g++.exe (GCC) 3.4.0 (mingw special)
*/

#include <stdio.h>
#include <math.h>

int main()
{
      /*************** A1 ******************/
      printf("%d\n", 11111 * 11111);            // 123454321
      printf("%d\n", 111111 * 111111);          // -539247567
      printf("%d\n", 111111111 * 111111111);    // 1653732529
      //六位向乘就溢出了，试试用ld 或者 lld 输出试试
      printf("%ld\n", 111111 * 111111);         // -539247567
      //warning：long int format, int arg (arg 2)，默认以int型数据运算
      long int a1 = 111111,a2 = 111111;
      printf("%ld\n", a1 * a2);                 // -539247567
      //warning: long int format, different type arg (arg 2)
      //看看 long long
      long long int b1 = a1, b2 = a1;
      printf("%ld\n", b1 * b2);                 // -539247567
      // Ok...

      /*************** A2 ******************/
      printf("%lf\n", 11111.0 * 11111);            // 123454321.000000
      printf("%lf\n", 111111.0 * 111111);          // 12345654321.000000
      printf("%lf\n", 111111111.0 * 111111111);    // 12345678987654320.000000
      // Ok~

      /*************** A3 ******************/
      printf("%c\n", sqrt(-10));    // 0
      //warning: int format, double arg (arg 2)
      printf("%d\n", sqrt(-10));    // 0
      //warning: int format, double arg (arg 2)
      printf("%ld\n", sqrt(-10));   // -1.#IND00
      //warning: long int format, double arg (arg 2)
      printf("%lf\n", sqrt(-10));   //没输出，没报错

      /*************** A4 ******************/
      printf("%c %c\n", 1.0/0.0, 0.0/0.0);      //<0x00> <0x00>
      printf("%d %d\n", 1.0/0.0, 0.0/0.0);      //0 2146435072
      printf("%ld %ld\n", 1.0/0.0, 0.0/0.0);    //0 2146435072
      printf("%f %f\n", 1.0/0.0, 0.0/0.0);      //1.#INF00 -1.#IND00
      printf("%lf %lf\n", 1.0/0.0, 0.0/0.0);    //1.#INF00 -1.#IND00
      /*
      1.#INF / inf：这个值表示“无穷大 (infinity 的缩写)”，即超出了计算机可以表示的浮点数的最大范围（或者说超过了 double 类型的最大值）。
            产生这个值的常见例子有：用 0 除一个整数；用 0 除一个负整数。
      -1.#IND / nan：这个的情况更复杂，一般来说，它们来自于任何未定义结果（非法）的浮点数运算。"IND"是 indeterminate 的缩写，而"nan"是 not a number 的缩写。
            产生这个值的常见例子有：对负数开平方，对负数取对数，0.0/0.0，0.0*∞, ∞/∞ 等。
      */

      /*************** A5 ******************/
      printf("%d\n", 1/0);    //编译器停止工作
      /*
      c语言下1/0会报错，但是1/0.0不会报错，而且还会有输出，怎么回事？
            前者用整数运算单元计算的，后者用浮点运算单元计算的。
            两个运算单元对这种情况的处理不同，前者是产生异常，后者是给出INFINITE（无穷大）的结果
            具体来说，0.0其实不是0，由于计算机浮点精度的原因，0.0实际上是一个很接近于0的数，但它不为0 
            计算机对于浮点数存储是不精确的，判断一个值是否为0的方式都是制定一个0.000001的数字，然后用大于-0.000001小于0.000001来判断，这样浮点的0是一个很小的数，但不是0
      */

      return 0;
}
