/*
* 算法竞赛入门 1.5.2
* 编译环境：Win10 + g++.exe (GCC) 3.4.0 (mingw special)
*/

#include <stdio.h>

int main()
{
      /*************** B1 ******************/
      int a, b;
      scanf("%d%d", &a, &b);        // 可以

      printf("%d %d\n", a, b);

      // B2 可以
      // B3 可以

      /*************** B4 ******************/
      // 1: 12 41428456
      // 2: 12 1975784
      // 3: 12 41690600

      int c;
      scanf("%d", &c);
      printf("%d\n", c);
      //输入一个字符读入的是一个较大的整数

      return 0;
}
